ConfigFiles/Documents/УчетВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>УчетВремени</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УчетВремени</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьРабочая</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗатратыВремени</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Проект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗадачиПроцесса</v8:Type>
								<v8:Type>cfg:CatalogRef.Ошибки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеРаботы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТехническийПроект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТехническиеПроекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начало</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Окончание</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Длительность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ConfigFiles/Documents/УчетВремени/Forms/РанееВыполнявшиесяРаботы/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Работы.РежимВыбора = Параметры.РежимВыбора;
	Элементы.ВедениеХронометража.Видимость = НЕ Параметры.РежимВыбора;
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	ПериодИзНастроек = ОбщегоНазначения.ХранилищеНастроекДанныхФормЗагрузить("УчетВремениПодборРабот", "Период");
	
	Если ТипЗнч(ПериодИзНастроек) = Тип("СтандартныйПериод") Тогда
		Период = ПериодИзНастроек;
	Иначе
		Период.Вариант = ВариантСтандартногоПериода.Месяц;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Работы, "Пользователь", ТекущийПользователь, Истина);
	УстановитьПериод();
																			
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПереключенХронометраж" Тогда
		Элементы.Работы.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ПриИзмененииПериодаНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыРаботы

&НаКлиенте
Процедура РаботыВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	Если Элемент.ТекущаяСтрока <> Неопределено Тогда
		ДанныеВыбраннойСтроки = ДанныеСтроки(Элемент.ТекущиеДанные);
		ОповеститьОВыборе(ДанныеВыбраннойСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаботыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ВедениеХронометража" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Работа = Неопределено;
		
		Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Работа) Тогда
			Работа = Элемент.ТекущиеДанные.Работа;
		ИначеЕсли ЗначениеЗаполнено(Элемент.ТекущиеДанные.ВидДеятельности) Тогда
			Работа = Элемент.ТекущиеДанные.ВидДеятельности;
		КонецЕсли;
		
		ДанныеХронометража = ПереключитьХронометражНаСервере(Работа, Элемент.ТекущиеДанные.ОписаниеРаботы);
		
		Оповестить("ПереключенХронометраж", ДанныеХронометража, ЭтотОбъект);
		
		Если ДанныеХронометража.ХронометражЗавершен Тогда
			ДанныеОповещения = Новый Структура;
			ДанныеОповещения.Вставить("Начало", ДанныеХронометража.НачалоЗавершеннойРаботы);
			ДанныеОповещения.Вставить("Окончание", ДанныеХронометража.ОкончаниеЗавершеннойРаботы);
			
			Оповестить("ЗаписаныДанныеКалендаря", ДанныеОповещения, ЭтотОбъект);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ДанныеСтроки(ДанныеСтроки)		
	
	Результат = Новый Структура;
	Результат.Вставить("Проект", ДанныеСтроки.Проект);
	Результат.Вставить("Работа", ДанныеСтроки.Работа);
	Результат.Вставить("ОписаниеРаботы", ДанныеСтроки.ОписаниеРаботы);
	Результат.Вставить("ВидДеятельности", ДанныеСтроки.ВидДеятельности);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПриИзмененииПериодаНаСервере()
	
	УстановитьПериод();
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить("УчетВремениПодборРабот", "Период", Период);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПериод()
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Работы, "НачалоПериода", Период.ДатаНачала, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Работы, "КонецПериода", Период.ДатаОкончания, Истина);
	
КонецПроцедуры

&НаСервере
Функция ПереключитьХронометражНаСервере(Работа, ОписаниеРаботы)
	
	ДанныеХронометража = УчетВремени.ПереключитьХронометраж(Работа, ОписаниеРаботы);
	
	Элементы.Работы.Обновить();
	
	Возврат ДанныеХронометража;
	
КонецФункции

#КонецОбласти
